a = {
    "Теория информации" : "Семахин А.М.",
    "Алгоритмы и структуры данных" : "Семахин А.М.",
    "Специальные главы математики" : "Косовских С.В.",
    "Основы теории формальных языков" : "Черепанов О.С.",
    "Иностранный язык" : ["Жирова Л.Г.", "Комарова Н.И."],
    "Теория вероятностей и математическая статистика" : "Косовских С.В.",
    "Философия" : "Прокопьева М.Ю.",
    "Объектно-ориентированное программирование" : "Черепанов О.С.",
    "Элективные курсы по физической культуре и спорту" : "Ловыгина О.Н.",
    "Обучение служением" : "Адаменко Ю.В."
}